/*
 * @Computer.java		1.00 2019/03/26
 * 
 * Copyright(c)2019 	HwiJin Hong.
 * All right reserved.
 * 
 * 숫자 야구 게임 프로그램
 * 1~9까지 서로 다른 수로 이루어진 3자리 수를 맞추는 게임입니다.
 * 같은 수가 같은 자리에 있다면 스트라이크, 다른 자리에 있으면 볼, 해당하는 숫자가 전혀 없으면 "포볼"을 출력합니다.
 * 컴퓨터는 기본적으로 3자리의 숫자 정보를 배열로 가지고 있습니다.
 * 사용자로부터 숫자를 생성해 달라는 요청(게임이 진행)을 받았을 때 서로 다른 숫자를 랜덤 메서드를 통해 생성합니다.
 * 게임진행 도중 사용자로부터 비교 요청을 받으면 비교 요청에 대한 결과를 배열로 리턴합니다.
 * 비교 요청에 대한 결과는 배열 인덱스 순서대로 스트라이크, 볼, 아웃 의 개수입니다.
 * 
 */

package edu.woowa.baseball;
/**
 * 숫자 야구 게임의 상대방 역할을 하는 컴퓨터 클래스
 * @version 1.00 2019년 03월 26일
 * @author 홍휘진
 */
public class Computer {
	
}
